chem/chemhw3/chemhw.tex
% Created 2021-08-27 Fri 14:52
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[dvipsnames]{xcolor}
\usepackage[colorlinks=true, linkcolor=Blue, citecolor=BrickRed, urlcolor=PineGreen]{hyperref}
\usepackage{indentfirst}
\setmainfont[Ligatures=TeX]{IBM Plex Sans}
\setmonofont[Ligatures=TeX]{Liga SFMono Nerd Font}
\usepackage{chemfig}
\usepackage[version=4]{mhchem}
\usepackage{enumerate}

% features: (acronym underline par-sep)
\newcommand{\acr}[1]{\protect\textls*[110]{\scshape #1}}
\newcommand{\acrs}{\protect\scalebox{.91}[.84]{\hspace{0.15ex}s}}
\usepackage[normalem]{ulem}
\setlength{\parskip}{\baselineskip}
\setlength{\parindent}{0pt}

% end features

%% make document follow Emacs theme

\definecolor{obg}{HTML}{FDF6E3}
\definecolor{ofg}{HTML}{556b72}

\pagecolor{obg}
\color{ofg}

% list labels

\definecolor{itemlabel}{HTML}{268bd2}

\renewcommand{\labelitemi}{\textcolor{itemlabel}{\textbullet}}
\renewcommand{\labelitemii}{\textcolor{itemlabel}{\normalfont\bfseries \textendash}}
\renewcommand{\labelitemiii}{\textcolor{itemlabel}{\textasteriskcentered}}
\renewcommand{\labelitemiv}{\textcolor{itemlabel}{\textperiodcentered}}

\renewcommand{\labelenumi}{\textcolor{itemlabel}{\theenumi.}}
\renewcommand{\labelenumii}{\textcolor{itemlabel}{(\theenumii)}}
\renewcommand{\labelenumiii}{\textcolor{itemlabel}{\theenumiii.}}
\renewcommand{\labelenumiv}{\textcolor{itemlabel}{\theenumiv.}}

% structural elements

\definecolor{documentTitle}{HTML}{d33682}
\definecolor{documentInfo}{HTML}{d33682}
\definecolor{level1}{HTML}{268bd2}
\definecolor{level2}{HTML}{d33682}
\definecolor{level3}{HTML}{6c71c4}
\definecolor{level4}{HTML}{5ca8dd}
\definecolor{level5}{HTML}{de68a1}
\definecolor{level6}{HTML}{92c4e8}
\definecolor{level7}{HTML}{e99ac0}
\definecolor{level8}{HTML}{d3e7f6}

\addtokomafont{title}{\color{documentTitle}}
\addtokomafont{author}{\color{documentInfo}}
\addtokomafont{date}{\color{documentInfo}}
\addtokomafont{section}{\color{level1}}
\newkomafont{sectionprefix}{\color{level1}}
\addtokomafont{subsection}{\color{level2}}
\newkomafont{subsectionprefix}{\color{level2}}
\addtokomafont{subsubsection}{\color{level3}}
\newkomafont{subsubsectionprefix}{\color{level3}}
\addtokomafont{paragraph}{\color{level4}}
\newkomafont{paragraphprefix}{\color{level4}}
\addtokomafont{subparagraph}{\color{level5}}
\newkomafont{subparagraphprefix}{\color{level5}}

% textual elements

\definecolor{link}{HTML}{268bd2}
\definecolor{cite}{HTML}{800080}
\definecolor{itemlabel}{HTML}{268bd2}
\definecolor{code}{HTML}{cb4b16}
\definecolor{verbatim}{HTML}{859900}

\renewcommand{\labelitemi}{\textcolor{itemlabel}{\textbullet}}
\renewcommand{\labelitemii}{\textcolor{itemlabel}{\normalfont\bfseries \textendash}}
\renewcommand{\labelitemiii}{\textcolor{itemlabel}{\textasteriskcentered}}
\renewcommand{\labelitemiv}{\textcolor{itemlabel}{\textperiodcentered}}

\renewcommand{\labelenumi}{\textcolor{itemlabel}{\theenumi.}}
\renewcommand{\labelenumii}{\textcolor{itemlabel}{(\theenumii)}}
\renewcommand{\labelenumiii}{\textcolor{itemlabel}{\theenumiii.}}
\renewcommand{\labelenumiv}{\textcolor{itemlabel}{\theenumiv.}}

\DeclareTextFontCommand{\texttt}{\color{code}\ttfamily}
\makeatletter
\def\verbatim@font{\color{verbatim}\normalfont\ttfamily}
\makeatother

% code blocks

\definecolor{codebackground}{HTML}{FDF6E3}
\colorlet{EFD}{ofg}
\definecolor{codeborder}{HTML}{f4efdd}

%% end customisations

\author{Shaurya Singh}
\date{\today}
\title{Ap Chem Summer Assignment \#3}
\colorlet{greenyblue}{blue!70!green}
\colorlet{blueygreen}{blue!40!green}
\providecolor{link}{named}{greenyblue}
\providecolor{cite}{named}{blueygreen}
\hypersetup{
  pdfauthor={Shaurya Singh},
  pdftitle={Ap Chem Summer Assignment \#3},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 28.0.50 (Org mode 9.5)},
  pdflang={English},
  breaklinks=true,
  colorlinks=true,
  linkcolor=,
  urlcolor=link,
  citecolor=cite
}
\urlstyle{same}
\begin{document}

\maketitle

\section{The following reaction was performed, Identify element X.}
\label{sec:orga7ddfcb}
\begin{align*}
  &\ce{Fe2O_3(s)+2X(s)} = \ce{2Fe(s)+X_2O_3(s)}\\
  &79.947g+2x=55.847g+50.982g\\
  &2x=106.829g-79.847g\\
  &2x=26.982g\\
\end{align*}
Since the atomic weight of \(\ce{2Fe}\) is the same as the given weight
(\(55.847g\)), the atomic weight of 2x is \(26.982g\) or Aluminium (\(\ce{Al}\))

\section{Fill in the blanks to balance the following chemical equations:}
\label{sec:org6e579ac}
\begin{enumerate}
\item \(\ce{2AgI+Na2S} \rightarrow \ce{2Ag2S+NaI}\)
\item \(\ce{(NH4)2Cr2O7} \rightarrow \ce{Cr2O3+N2+4H2O}\)
\item \(\ce{Na3PO4+3HCl} \rightarrow \ce{3NaCl+H3PO4}\)
\item \(\ce{TiCl4+2H2O} \rightarrow \ce{TiO2+4HCl}\)
\item \(\ce{Ba3N2+6H2O} \rightarrow \ce{3Ba(OH)2+2NH3}\)
\item \(\ce{3HNO2+HNO3} \rightarrow \ce{2NO+H2O}\)
\end{enumerate}

\section{Balance the following equation:}
\label{sec:org295684c}
\(\ce{4NH4OH(aq)+KAI(SO)4\cdot12H2O}=\ce{Al(OH)3(s)+2(NH4)2Cr2O7+KOH(aq)+12H2O}\)

We can multiple \(\ce{NH4OH}\) by 4, and increase NH4 and H2O on the product
side to compensate

\section{Balance the following equation}
\label{sec:orgd1e9c34}
\(\ce{2Fe+6HC2H3O2}=\ce{2Fe(C2H3O2)3+3H2}\)

\section{How many grams of water vapor can be generated from the combustion of 18.74 g of ethanol (C 2 H 6 O)?}
\label{sec:org6a06753}

\section{How many grams of potassium iodide are necessary to completely react with 20.61g of Mercury (II) chloride}
\label{sec:orgd152103}
First we balance the equation
\(\ce{HgCl2+2KL}=\ce{HgI2+2KCl}\)
Next we to find the total atomic weight.
\(200.59+2(35.45)+2(39.10+126.90)\)
Afterwards, we calculate the ratio needed
\(\frac{332}{271.49}=1.22\)
Finally we multiply
\(20.61*1.22=25.203\)

\section{A reaction combines 113.484 g of lead (II) nitrate with 45.010 g of sodium hydroxide (NaOH[aq]).}
\label{sec:org48ee9f8}
Pb(NO3)2+ 2NaOH→ Pb(OH)2+ 2NaNO3
83.4 grams of Pb(OH)2
The limiting reactant is lead (II) nitrate (0.345837 mols) and the excess reactant left over is sodium hydroxide (1.7773 mols).   1.431463
There is 57.256 grams of the excess reactant left over.
The percent yield is 95.9\%.


\section{A reaction combines 64.81 grams of silver nitrate with 92.67 grams of potassium bromide}
\label{sec:org8a6d206}
\begin{enumerate}
\item 72g
\item \(\ce{AgNO3}\) is the limiting reactant
\item 47.3g
\item 20.5\%
\end{enumerate}

\section{The moleculer weight of an insecticide, dibromoethane, is 187.9. Its molecular formula is \(\ce{C2H4Br2}\), What percent by mass of bromine does dibromoethane contain?}
\label{sec:orgae96d80}
First we have the following variables
\begin{align*}
&\ce{C} = 12.011\\
&\ce{H} = 1.008\\
&\ce{Br} = 79.90
\end{align*}

Since the formula is  \(\ce{C2H4Br2}\), we can substitute and do the following:

\begin{align*}
&= 24.022 + 4.032 + 159.8\\
&= 187.9\\
&= 159.8/187.9\\
&=.8505
\end{align*}

Therefore, dibromoethane contains \(85.05\) percent by mass of bromine.

\section{A given sample of xenon fluoride contains molecules of a single type of \(\ce{XeFn}\), where n is some whole number.}
\label{sec:org71e1ffc}

First, we need to calculate how many moles of xenon fluoride there are, and
calculate its weight.

\begin{align*}
moles&=9.03*10^{20}/6.022*10^{23}\\
&= 1.5*10^-3\\
&= 0.31g
\end{align*}

Now, we can calculate for \(n\)

\begin{align*}
&= 0.31/131+19n\\
&= 186.5 + 23.5n = 310\\
&n = 4
\end{align*}

Therefore its formula is \(\ce{XeF4}\)

\section{A 6.32 g sample of potassium chlorate was decomposed according to the following equation, how many moles were formed?}
\label{sec:org077c84d}

k = 39.0983
Cl = 35.45
O = 16.00
39.0983 + 35.45 + 3*16 = 122.55g

6.32/122.55 = 6.052 moles
2 mol KClO3 = 3 mol O2
2 = 3
0.052*3/2
= 0.078 mol

\section{What is the coefficient in front of water, when it is produced from the reaction of hydrochloric acid with calcium hydroxide? Calcium chloride is the other product.}
\label{sec:orga4b52ab}

\(\ce{Ca(OH)2+2HCl}=\ce{CaCl2 + 2H2O}\)

Therefore the coeffecient is 2

\section{What is the subscript of aluminum in the formula of aluminum phosphate?}
\label{sec:org61df2ec}
1

\section{The reaction of 11.9 g of CHCl 3 with excess chlorine produced 12.6 g of CCl 4 , carbon tetrachloride, what is the percent yield?}
\label{sec:org324fdd4}

\(\ce{2CHCl3 + 2Cl2}=\ce{2CCl4+2HCl}\)

\(\ce{CHCl3=}\) 119.378
\(\ce{CCl4=}\) 153.823

Theoretical mass = 153.823 * 0.097 = 15.336g
\% yield = 12.6/15.336 = \%82.16

\section{What mass of CCl 4 is formed by the reaction of 8.00 g of methane with an excess of chlorine?Ch4 is the limiting reactant}
\label{sec:org38cb5b0}

8x 1 mol Ch4 / 16.04 g/mol = .499

.499 * 153.82 = 76.72g

\section{A reaction occurs between sodium carbonate and hydrochloric acid producing sodium chloride, carbon dioxide, and water. Write the balanced chemical equation for the reaction.}
\label{sec:orgf1d6d9d}

sodium carbonate + hydrohloric acid = sodium chloride + carbon doxide + water
= \(\ce{Na2CO3+HCl}+\ce{NaCl + CO2 + H2O}\)
= \(\ce{Na2CO3+2HCl}+\ce{2NaCl + 2CO2 + H2O}\)

\section{Classify the type of reaction from the five major type of reactions you learned in your first year chemistry course and write word equations. If necessary, balance.}
\label{sec:orgf260c5d}

\begin{enumerate}
\item \(\ce{NaOH + KNO3}=\ce{NaNO3+KOH}\) = double replacement
\item \(\ce{CH4+2O2}=\ce{}\) = combustion
\item \(\ce{Fe + 3NaBr}=\ce{FaBr2+3Na}\) = single replacement
\item already balanced, double replacement
\item already balanced, double replacement
\item already balanced, synthesis
\item already balanced, decomposition
\end{enumerate}

\section{Now try these recation types, Rewrite as a balanced equation with the products predicted}
\label{sec:orgb5135a3}
\begin{enumerate}
\item Ba(OH)2 -> BaO+H2O
\item Na2CO3 -> Na2O +CO2
\item 2LiCLI3 -> 2LiCL + 3O2
\item Al2O3 -> 2AL2 + O3
\item H2SO4 -> H2O + SO3
\end{enumerate}

\section{Now try these recation types, Rewrite as a balanced equation with the products predicted}
\label{sec:org9549a98}

\begin{enumerate}
\item 2Mg + O2 = 2MgO
\item N2 + 3H2 = 2NH3
\item S + O2 = SO2
\item CaO + H2O -> Ca(OH)2
\end{enumerate}

\section{Attempt to write and predict products the following chemical reactions:}
\label{sec:orgfdf733e}
\begin{enumerate}
\item 2H2O2 -> 2H2O + O2
\item Cu2+ + So42- + Ba2+ - 20H- -> Cu (OH)2 + BaSO4
\item Al+3Ag+ -> Al3+ + 3Ag
\item Cl2 + 2NaBr -> Br2 + 2NaCl
\item C2H6 + 3O2 -> CO2 + CO + 3H2O
\end{enumerate}

\section{Using the solubility rules table, classify each of the substances as being soluble or insoluble in water. Then, Identify the two new compounds that form if the solutions, as suggested by the following table, were mixed via a double displacement reaction.}
\label{sec:org6cf11da}

\subsection{Part A}
\label{sec:org65fb7cf}
\begin{enumerate}
\item Soluble
\item Insoluble
\item Insoluble
\item Insoluble
\item Soluble
\item Insoluble
\item Insoluble
\item Insoluble
\item Soluble
\item Insoluble.
\item Insoluble
\item Soluble
\item Soluble
\item Soluble
\item Insoluble
\item Insoluble
\end{enumerate}

\subsection{Part B}
\label{sec:org053b9ca}
\begin{enumerate}
\item \(\ce{AgBr(s)\ KNO3(aq)}\)
\(\ce{BaBr2(aq)\ KCl(aq)}\)
\(\ce{AlBr3(aq)\ KNO3(aq)}\)
\(\ce{K2SO4(aq)\ CuBr2(aq)}\)

\item \(\ce{Ag2CO3(s)\ KNO3(aq)}\)
\(\ce{NaCl(aq)\ KCl(aq)}\)
\(\ce{Al2(CO3)3(s)\ KNO3(aq)}\)
\(\ce{CuCO3(s)\ CuBr2(aq)}\)

\item \(\ce{Ag2S(s)\ KNO3(aq)}\)
\(\ce{CaCl(aq)\ KCl(aq)}\)
\(\ce{AlBr3(aq)\ KNO3(aq)}\)
\(\ce{K2SO4(aq)\ CuBr2(aq)}\)

\item \(\ce{AgOH(s)\ KNO3(aq)}\)
\(\ce{Ba(OH)2(aq)\ KCl(aq)}\)
\(\ce{Al(OH)3(aq)\ KNO3(aq)}\)
\(\ce{NH4(SO4)2(aq)\ CuBr2(aq)}\)
\end{enumerate}

\section{Name the following, then draw the Lewis Structure for the following hydrocarbons from their full names.}
\label{sec:orge218002}

\begin{enumerate}
\item \(\ce{CH4}\) - methane
\item \(\ce{C3H8}\) - propane
\item \(\ce{C4H8}\) - butene
\item \(\ce{C4H8}\) - butyne

\item Ethane \(\ce{C2H}\) (c-c)
\item Methane \(\ce{CH4}\) (c-c)
\item Propyne \(\ce{C3H4}\) (c---c)
\item 2 \(\cdot\) Butene \(\ce{2C4H8}\) (c---c)
\end{enumerate}
\end{document}
